read_verilog and_gate.v
hierarchy -check -top and_gate
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib
abc -liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib
clean
show
write_verilog and_gate_netlist.v
